IRP/src/AccumulationRegisters/R5020B_PartnersBalance/R5020B_PartnersBalance.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R5020B_PartnersBalance</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>CustomerTransaction</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>CustomerAdvance</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>VendorTransaction</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>VendorAdvance</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>OtherTransaction</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <attributes>
  <name>AdvancesClosing</name>
  <type>
   <types>DocumentRef.CustomersAdvancesClosing</types>
   <types>DocumentRef.VendorsAdvancesClosing</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Document</name>
  <type>
   <types>DefinedType.typeApArTransactionBasises</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R5020B_PartnersBalance/RecordSetModule.bsl
Procedure BeforeWrite(Cancel, Replacing)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	For Each _row In ThisObject Do
		If ValueIsFilled(_row.AdvancesClosing) Then
			Continue;
		EndIf;
		_row.Amount = 
			  _row.CustomerTransaction 
			  + _row.CustomerAdvance
			  + _row.VendorTransaction
			  + _row.VendorAdvance
			  + _row.OtherTransaction;
	EndDo;	
EndProcedure
